TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_memcfg.h
//###########################################################################
//
// FILE:    hw_memcfg.h
//
// TITLE:   Definitions for the MEMCFG registers.
//
//###########################################################################
// 
// C2000Ware v26.01.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_MEMCFG_H
#define HW_MEMCFG_H

//*************************************************************************************************
//
// The following are defines for the MEMCFG register offsets
//
//*************************************************************************************************
#define MEMCFG_O_DXLOCK             0x0U                     // Dedicated RAM Config Lock Register
#define MEMCFG_O_DXCOMMIT           0x2U                     // Dedicated RAM Config Lock Commit
                                                             // Register
#define MEMCFG_O_DXACCPROT0         0x8U                     // Dedicated RAM Config Register
#define MEMCFG_O_DXACCPROT1         0xAU                     // Dedicated RAM Config Register
#define MEMCFG_O_DXTEST             0x10U                    // Dedicated RAM TEST Register
#define MEMCFG_O_DXINIT             0x12U                    // Dedicated RAM Init Register
#define MEMCFG_O_DXINITDONE         0x14U                    // Dedicated RAM InitDone Status
                                                             // Register
#define MEMCFG_O_DXRAMTEST_LOCK     0x16U                    // Lock register to Dx RAM TEST
                                                             // registers
#define MEMCFG_O_LSXLOCK            0x20U                    // Local Shared RAM Config Lock
                                                             // Register
#define MEMCFG_O_LSXCOMMIT          0x22U                    // Local Shared RAM Config Lock Commit
                                                             // Register
#define MEMCFG_O_LSXMSEL            0x24U                    // Local Shared RAM Controller Sel
                                                             // Register
#define MEMCFG_O_LSXCLAPGM          0x26U                    // Local Shared RAM Prog/Exe control
                                                             // Register
#define MEMCFG_O_LSXACCPROT0        0x28U                    // Local Shared RAM Config Register 0
#define MEMCFG_O_LSXACCPROT1        0x2AU                    // Local Shared RAM Config Register 1
#define MEMCFG_O_LSXACCPROT2(i)     (0x2CU + ((i) * 0x2U))   // (0 <= i < 2) Local Shared RAM
                                                             // Config Register 2
#define MEMCFG_O_LSXTEST            0x30U                    // Local Shared RAM TEST Register
#define MEMCFG_O_LSXINIT            0x32U                    // Local Shared RAM Init Register
#define MEMCFG_O_LSXINITDONE        0x34U                    // Local Shared RAM InitDone Status
                                                             // Register
#define MEMCFG_O_LSXRAMTEST_LOCK    0x36U                    // Lock register to LSx RAM TEST
                                                             // registers
#define MEMCFG_O_GSXLOCK            0x40U                    // Global Shared RAM Config Lock
                                                             // Register
#define MEMCFG_O_GSXCOMMIT          0x42U                    // Global Shared RAM Config Lock
                                                             // Commit Register
#define MEMCFG_O_GSXACCPROT0        0x48U                    // Global Shared RAM Config Register 0
#define MEMCFG_O_GSXTEST            0x50U                    // Global Shared RAM TEST Register
#define MEMCFG_O_GSXINIT            0x52U                    // Global Shared RAM Init Register
#define MEMCFG_O_GSXINITDONE        0x54U                    // Global Shared RAM InitDone Status
                                                             // Register
#define MEMCFG_O_GSXRAMTEST_LOCK    0x56U                    // Lock register to GSx RAM TEST
                                                             // registers
#define MEMCFG_O_MSGXLOCK           0x60U                    // Message RAM Config Lock Register
#define MEMCFG_O_MSGXCOMMIT         0x62U                    // Message RAM Config Lock Commit
                                                             // Register
#define MEMCFG_O_MSGXTEST           0x70U                    // Message RAM TEST Register
#define MEMCFG_O_MSGXINIT           0x72U                    // Message RAM Init Register
#define MEMCFG_O_MSGXINITDONE       0x74U                    // Message RAM InitDone Status
                                                             // Register
#define MEMCFG_O_MSGXRAMTEST_LOCK   0x76U                    // Lock register for MSGx RAM TEST
                                                             // Register
#define MEMCFG_O_ROM_LOCK           0xA0U                    // ROM Config Lock Register
#define MEMCFG_O_ROM_TEST           0xA2U                    // ROM  TEST Register
#define MEMCFG_O_ROM_FORCE_ERROR    0xA4U                    // ROM Force Error register

#define MEMCFG_O_NMAVFLG          0x0U    // Non-Controller Access Violation Flag Register
#define MEMCFG_O_NMAVSET          0x2U    // Non-Controller Access Violation Flag Set Register
#define MEMCFG_O_NMAVCLR          0x4U    // Non-Controller Access Violation Flag Clear Register
#define MEMCFG_O_NMAVINTEN        0x6U    // Non-Controller Access Violation Interrupt Enable
                                          // Register
#define MEMCFG_O_NMCPURDAVADDR    0x8U    // Non-Controller CPU Read Access Violation Address
#define MEMCFG_O_NMCPUWRAVADDR    0xAU    // Non-Controller CPU Write Access Violation Address
#define MEMCFG_O_NMCPUFAVADDR     0xCU    // Non-Controller CPU Fetch Access Violation Address
#define MEMCFG_O_NMDMAWRAVADDR    0xEU    // Non-Controller DMA Write Access Violation Address
#define MEMCFG_O_NMCLA1RDAVADDR   0x10U   // Non-Controller CLA1 Read Access Violation Address
#define MEMCFG_O_NMCLA1WRAVADDR   0x12U   // Non-Controller CLA1 Write Access Violation Address
#define MEMCFG_O_NMCLA1FAVADDR    0x14U   // Non-Controller CLA1 Fetch Access Violation Address
#define MEMCFG_O_NMDMARDAVADDR    0x1CU   // Non-Controller DMA Read Access Violation Address
#define MEMCFG_O_MAVFLG           0x20U   // Controller Access Violation Flag Register
#define MEMCFG_O_MAVSET           0x22U   // Controller Access Violation Flag Set Register
#define MEMCFG_O_MAVCLR           0x24U   // Controller Access Violation Flag Clear Register
#define MEMCFG_O_MAVINTEN         0x26U   // Controller Access Violation Interrupt Enable Register
#define MEMCFG_O_MCPUFAVADDR      0x28U   // Controller CPU Fetch Access Violation Address
#define MEMCFG_O_MCPUWRAVADDR     0x2AU   // Controller CPU Write Access Violation Address
#define MEMCFG_O_MDMAWRAVADDR     0x2CU   // Controller  DMA Write Access Violation Address
#define MEMCFG_O_NMNPURDAVADDR    0x3AU   // Non-Controller NPU Read Access Violation Address
#define MEMCFG_O_NMNPUWRAVADDR    0x3CU   // Non-Controller NPU Write Access Violation Address

#define MEMCFG_O_UCERRFLG        0x0U    // Uncorrectable Error Flag Register
#define MEMCFG_O_UCERRSET        0x2U    // Uncorrectable Error Flag Set Register
#define MEMCFG_O_UCERRCLR        0x4U    // Uncorrectable Error Flag Clear Register
#define MEMCFG_O_UCCPUREADDR     0x6U    // Uncorrectable CPU Read Error Address
#define MEMCFG_O_UCDMAREADDR     0x8U    // Uncorrectable DMA Read Error Address
#define MEMCFG_O_UCCLA1READDR    0xAU    // Uncorrectable CLA1 Read Error Address
#define MEMCFG_O_UCNPUREADDR     0x10U   // Uncorrectable NPU Read Error Address
#define MEMCFG_O_FLUCERRSTATUS   0x1CU   // Flash read uncorrectable ecc err status
#define MEMCFG_O_FLCERRSTATUS    0x1EU   // Flash read correctable ecc err status
#define MEMCFG_O_CERRFLG         0x20U   // Correctable Error Flag Register
#define MEMCFG_O_CERRSET         0x22U   // Correctable Error Flag Set Register
#define MEMCFG_O_CERRCLR         0x24U   // Correctable Error Flag Clear Register
#define MEMCFG_O_CCPUREADDR      0x26U   // Correctable CPU Read Error Address
#define MEMCFG_O_CDMAREADDR      0x28U   // Correctable DMA Read Error Address
#define MEMCFG_O_CCLA1READDR     0x2AU   // Correctable CLA1 Read Error Address
#define MEMCFG_O_CERRCNT         0x2EU   // Correctable Error Count Register
#define MEMCFG_O_CERRTHRES       0x30U   // Correctable Error Threshold Value Register
#define MEMCFG_O_CEINTFLG        0x32U   // Correctable Error Interrupt Flag Status Register
#define MEMCFG_O_CEINTCLR        0x34U   // Correctable Error Interrupt Flag Clear Register
#define MEMCFG_O_CEINTSET        0x36U   // Correctable Error Interrupt Flag Set Register
#define MEMCFG_O_CEINTEN         0x38U   // Correctable Error Interrupt Enable Register

