TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_memcfg.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxCOMMIT register
//
//*************************************************************************************************
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCLA1   0x2U    // CPUTOCLA1 RAM control fields COMMIT bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CLA1TOCPU   0x4U    // CLA1TOCPU RAM control fields COMMIT bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CLA1TODMA   0x20U   // CLA1TODMA RAM control fields COMMIT bit
#define MEMCFG_MSGXCOMMIT_COMMIT_DMATOCLA1   0x40U   // DMATOCLA1 RAM control fields COMMIT bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxTEST register
//
//*************************************************************************************************
#define MEMCFG_MSGXTEST_TEST_CPUTOCLA1_S   2U
#define MEMCFG_MSGXTEST_TEST_CPUTOCLA1_M   0xCU      // CPU to CLA1 MSG RAM Mode Select
#define MEMCFG_MSGXTEST_TEST_CLA1TOCPU_S   4U
#define MEMCFG_MSGXTEST_TEST_CLA1TOCPU_M   0x30U     // CLA1 to CPU MSG RAM Mode Select
#define MEMCFG_MSGXTEST_TEST_CLA1TODMA_S   10U
#define MEMCFG_MSGXTEST_TEST_CLA1TODMA_M   0xC00U    // CLA1 to DMA MSG RAM Mode Select
#define MEMCFG_MSGXTEST_TEST_DMATOCLA1_S   12U
#define MEMCFG_MSGXTEST_TEST_DMATOCLA1_M   0x3000U   // DMA to CLA1 MSG RAM Mode Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxINIT register
//
//*************************************************************************************************
#define MEMCFG_MSGXINIT_INIT_CPUTOCLA1   0x2U    // Initialization control for CPUTOCLA1 MSG RAM
#define MEMCFG_MSGXINIT_INIT_CLA1TOCPU   0x4U    // Initialization control for CLA1TOCPU MSG RAM
#define MEMCFG_MSGXINIT_INIT_CLA1TODMA   0x20U   // Initialization control for CLA1 to DMA MSG RAM
#define MEMCFG_MSGXINIT_INIT_DMATOCLA1   0x40U   // Initialization control for DMA to CLA1 MSG RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxINITDONE register
//
//*************************************************************************************************
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCLA1   0x2U    // Initialization status for CPU to CLA1
                                                         // MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TOCPU   0x4U    // Initialization status for CLA1 to CPU
                                                         // MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TODMA   0x20U   // Initialization status for CLA1 to DMA
                                                         // MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_DMATOCLA1   0x40U   // Initialization status for DMA to CLA1
                                                         // MSG RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxRAMTEST_LOCK register
//
//*************************************************************************************************
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCLA1   0x2U          // MSGxRAMTEST_LOCK.CPUTOCLA1Lock
                                                          // Configuration
#define MEMCFG_MSGXRAMTEST_LOCK_CLA1TOCPU   0x4U          // MSGxRAMTEST_LOCK.CLA1TOCPULock
                                                          // Configuration
#define MEMCFG_MSGXRAMTEST_LOCK_CLA1TODMA   0x20U         // MSGxRAMTEST_LOCK.CLA1TODMALock
                                                          // Configuration
#define MEMCFG_MSGXRAMTEST_LOCK_DMATOCLA1   0x40U         // MSGxRAMTEST_LOCK.DMATOCLA1Lock
                                                          // Configuration
#define MEMCFG_MSGXRAMTEST_LOCK_KEY_S       16U
#define MEMCFG_MSGXRAMTEST_LOCK_KEY_M       0xFFFF0000U   // KEY to enable write to lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_LOCK register
//
//*************************************************************************************************
#define MEMCFG_ROM_LOCK_LOCK_BOOTROM      0x1U          // BOOTROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_SECUREROM    0x2U          // SECUREROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_CLADATAROM   0x4U          // CLADATAROM Lock bits
#define MEMCFG_ROM_LOCK_KEY_S             16U
#define MEMCFG_ROM_LOCK_KEY_M             0xFFFF0000U   // Key for writing ROM LOCK

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_TEST register
//
//*************************************************************************************************
#define MEMCFG_ROM_TEST_TEST_BOOTROM_S      0U
#define MEMCFG_ROM_TEST_TEST_BOOTROM_M      0x3U    // Selects the different modes for BOOTROM
#define MEMCFG_ROM_TEST_TEST_SECUREROM_S    2U
#define MEMCFG_ROM_TEST_TEST_SECUREROM_M    0xCU    // Selects the different modes for SECUREROM
#define MEMCFG_ROM_TEST_TEST_CLADATAROM_S   4U
#define MEMCFG_ROM_TEST_TEST_CLADATAROM_M   0x30U   // Selects the different modes for CLADATAROM

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_FORCE_ERROR register
//
//*************************************************************************************************
#define MEMCFG_ROM_FORCE_ERROR_FORCE_BOOTROM_ERROR      0x1U   // Force Bootrom Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_SECUREROM_ERROR    0x2U   // Force SECUREROM Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_CLADATAROM_ERROR   0x4U   // Force CLADATAROM Parity Error


//*************************************************************************************************
//
// The following are defines for the bit fields in the NMAVFLG register
//
//*************************************************************************************************
#define MEMCFG_NMAVFLG_CPUREAD     0x1U      // Non Controller CPU Read Access Violation Flag
#define MEMCFG_NMAVFLG_CPUWRITE    0x2U      // Non Controller CPU Write Access Violation Flag
#define MEMCFG_NMAVFLG_CPUFETCH    0x4U      // Non Controller CPU Fetch Access Violation Flag
#define MEMCFG_NMAVFLG_DMAWRITE    0x8U      // Non Controller DMA Write Access Violation Flag
#define MEMCFG_NMAVFLG_CLA1READ    0x10U     // Non Controller CLA1 Read Access Violation Flag
#define MEMCFG_NMAVFLG_CLA1WRITE   0x20U     // Non Controller CLA1 Write Access Violation Flag
#define MEMCFG_NMAVFLG_CLA1FETCH   0x40U     // Non Controller CLA1 Fetch Access Violation Flag
#define MEMCFG_NMAVFLG_DMAREAD     0x400U    // Non Controller DMA Read Access Violation Flag
#define MEMCFG_NMAVFLG_NPUREAD     0x800U    // Non Controller NPU Read Access Violation Flag
#define MEMCFG_NMAVFLG_NPUWRITE    0x1000U   // Non Controller NPU Write Violation Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the NMAVSET register
//
//*************************************************************************************************
#define MEMCFG_NMAVSET_CPUREAD     0x1U      // Non Controller CPU Read Access Violation Flag Set
#define MEMCFG_NMAVSET_CPUWRITE    0x2U      // Non Controller CPU Write Access Violation Flag Set
#define MEMCFG_NMAVSET_CPUFETCH    0x4U      // Non Controller CPU Fetch Access Violation Flag Set
#define MEMCFG_NMAVSET_DMAWRITE    0x8U      // Non Controller DMA Write Access Violation Flag Set
#define MEMCFG_NMAVSET_CLA1READ    0x10U     // Non Controller CLA1 Read Access Violation Flag Set
#define MEMCFG_NMAVSET_CLA1WRITE   0x20U     // Non Controller CLA1 Write Access Violation Flag Set
#define MEMCFG_NMAVSET_CLA1FETCH   0x40U     // Non Controller CLA1 Fetch Access Violation Flag Set
#define MEMCFG_NMAVSET_DMAREAD     0x400U    // Non Controller DMA Read Access Violation Flag Set
#define MEMCFG_NMAVSET_NPUREAD     0x800U    // Non Controller NPU Read Access Violation Flag Set
#define MEMCFG_NMAVSET_NPUWRITE    0x1000U   // Non Controller NPU Write Access Violation Flag Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the NMAVCLR register
//
//*************************************************************************************************
#define MEMCFG_NMAVCLR_CPUREAD     0x1U      // Non Controller CPU Read Access Violation Flag Clear
#define MEMCFG_NMAVCLR_CPUWRITE    0x2U      // Non Controller CPU Write Access Violation Flag
                                             // Clear
#define MEMCFG_NMAVCLR_CPUFETCH    0x4U      // Non Controller CPU Fetch Access Violation Flag
                                             // Clear
#define MEMCFG_NMAVCLR_DMAWRITE    0x8U      // Non Controller DMA Write Access Violation Flag
                                             // Clear
#define MEMCFG_NMAVCLR_CLA1READ    0x10U     // Non Controller CLA1 Read Access Violation Flag
                                             // Clear
#define MEMCFG_NMAVCLR_CLA1WRITE   0x20U     // Non Controller CLA1 Write Access Violation Flag
                                             // Clear
#define MEMCFG_NMAVCLR_CLA1FETCH   0x40U     // Non Controller CLA1 Fetch Access Violation Flag
                                             // Clear
#define MEMCFG_NMAVCLR_DMAREAD     0x400U    // Non Controller DMA Read Access Violation Flag Clear
#define MEMCFG_NMAVCLR_NPUREAD     0x800U    // Non Controller NPU Read Access Violation Flag Clear
#define MEMCFG_NMAVCLR_NPUWRITE    0x1000U   // Non Controller NPU Write Access Violation Flag
                                             // Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the NMAVINTEN register
//
//*************************************************************************************************
#define MEMCFG_NMAVINTEN_CPUREAD     0x1U      // Non Controller CPU Read Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_CPUWRITE    0x2U      // Non Controller CPU Write Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_CPUFETCH    0x4U      // Non Controller CPU Fetch Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_DMAWRITE    0x8U      // Non Controller DMA Write Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1READ    0x10U     // Non Controller CLA1 Read Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1WRITE   0x20U     // Non Controller CLA1 Write Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1FETCH   0x40U     // Non Controller CLA1 Fetch Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_DMAREAD     0x400U    // Non Controller DMA Read Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_NPUREAD     0x800U    // Non Controller NPU Read Access Violation
                                               // Interrupt Enable
#define MEMCFG_NMAVINTEN_NPUWRITE    0x1000U   // Non Controller NPU Write Violation Interrupt
                                               // Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the MAVFLG register
//
//*************************************************************************************************
#define MEMCFG_MAVFLG_CPUFETCH   0x1U   // Controller CPU Fetch Access Violation Flag
#define MEMCFG_MAVFLG_CPUWRITE   0x2U   // Controller CPU Write Access Violation Flag
#define MEMCFG_MAVFLG_DMAWRITE   0x4U   // Controller DMA Write Access Violation Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the MAVSET register
//
//*************************************************************************************************
#define MEMCFG_MAVSET_CPUFETCH   0x1U   // Controller CPU Fetch Access Violation Flag Set
#define MEMCFG_MAVSET_CPUWRITE   0x2U   // Controller CPU Write Access Violation Flag Set
#define MEMCFG_MAVSET_DMAWRITE   0x4U   // Controller DMA Write Access Violation Flag Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the MAVCLR register
//
//*************************************************************************************************
#define MEMCFG_MAVCLR_CPUFETCH   0x1U   // Controller CPU Fetch Access Violation Flag Clear
#define MEMCFG_MAVCLR_CPUWRITE   0x2U   // Controller CPU Write Access Violation Flag Clear
#define MEMCFG_MAVCLR_DMAWRITE   0x4U   // Controller DMA Write Access Violation Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the MAVINTEN register
//
//*************************************************************************************************
#define MEMCFG_MAVINTEN_CPUFETCH   0x1U   // Controller CPU Fetch Access Violation Interrupt Enable
#define MEMCFG_MAVINTEN_CPUWRITE   0x2U   // Controller CPU Write Access Violation Interrupt Enable
#define MEMCFG_MAVINTEN_DMAWRITE   0x4U   // Controller DMA Write Access Violation Interrupt Enable


//*************************************************************************************************
//
// The following are defines for the bit fields in the UCERRFLG register
//
//*************************************************************************************************
#define MEMCFG_UCERRFLG_CPURDERR    0x1U    // CPU Uncorrectable Read Error Flag
#define MEMCFG_UCERRFLG_DMARDERR    0x2U    // DMA Uncorrectable Read Error Flag
#define MEMCFG_UCERRFLG_CLA1RDERR   0x4U    // CLA1 Uncorrectable Read Error Flag
#define MEMCFG_UCERRFLG_NPURDERR    0x20U   // NPU Uncorrectable Read Error Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the UCERRSET register
//
//*************************************************************************************************
#define MEMCFG_UCERRSET_CPURDERR    0x1U    // CPU Uncorrectable Read Error Flag Set
#define MEMCFG_UCERRSET_DMARDERR    0x2U    // DMA Uncorrectable Read Error Flag Set
#define MEMCFG_UCERRSET_CLA1RDERR   0x4U    // CLA1 Uncorrectable Read Error Flag Set
#define MEMCFG_UCERRSET_NPURDERR    0x20U   // NPU Uncorrectable Read Error Flag Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the UCERRCLR register
//
//*************************************************************************************************
#define MEMCFG_UCERRCLR_CPURDERR    0x1U    // CPU Uncorrectable Read Error Flag Clear
#define MEMCFG_UCERRCLR_DMARDERR    0x2U    // DMA Uncorrectable Read Error Flag Clear
#define MEMCFG_UCERRCLR_CLA1RDERR   0x4U    // CLA1 Uncorrectable Read Error Flag Clear
#define MEMCFG_UCERRCLR_NPURDERR    0x20U   // NPU Uncorrectable Read Error Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the FLUCERRSTATUS register
//
//*************************************************************************************************
#define MEMCFG_FLUCERRSTATUS_UNC_ERR_L     0x1U     // Lower 64 bits Uncorrectable error occurred
#define MEMCFG_FLUCERRSTATUS_DIAG_L_FAIL   0x2U     // Diagnostics of ECC on lower 64 bits.
#define MEMCFG_FLUCERRSTATUS_UNC_ERR_H     0x100U   // Upper 64 bits Uncorrectable error occurred
#define MEMCFG_FLUCERRSTATUS_DIAG_H_FAIL   0x200U   // Diagnostics of ECC on upper 64 bits.

//*************************************************************************************************
//
// The following are defines for the bit fields in the FLCERRSTATUS register
//
//*************************************************************************************************
#define MEMCFG_FLCERRSTATUS_FAIL_0_L      0x1U          // Lower 64bits Single Bit Error Corrected
                                                        // Value 0
#define MEMCFG_FLCERRSTATUS_FAIL_1_L      0x2U          // Lower 64bits Single Bit Error Corrected
                                                        // Value 1
#define MEMCFG_FLCERRSTATUS_FAIL_0_H      0x8U          // Upper 64bits Single Bit Error Corrected
                                                        // Value 0
#define MEMCFG_FLCERRSTATUS_FAIL_1_H      0x10U         // Upper 64bits Single Bit Error Corrected
                                                        // Value 1
#define MEMCFG_FLCERRSTATUS_ERR_POS_L_S   16U
#define MEMCFG_FLCERRSTATUS_ERR_POS_L_M   0x3F0000U     // Bit Position of Single bit Error in
                                                        // lower 64 bits
#define MEMCFG_FLCERRSTATUS_ERR_TYPE_L    0x400000U     // Error Type in lower 64 bits
#define MEMCFG_FLCERRSTATUS_ERR_POS_H_S   23U
#define MEMCFG_FLCERRSTATUS_ERR_POS_H_M   0x1F800000U   // Bit Position of Single bit Error in
                                                        // upper 64 bits
#define MEMCFG_FLCERRSTATUS_ERR_TYPE_H    0x20000000U   // Error Type in upper 64 bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRFLG register
//
//*************************************************************************************************
#define MEMCFG_CERRFLG_CPURDERR    0x1U   // CPU Correctable Read Error Flag
#define MEMCFG_CERRFLG_DMARDERR    0x2U   // DMA Correctable Read Error Flag
#define MEMCFG_CERRFLG_CLA1RDERR   0x4U   // CLA1 Correctable Read Error Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRSET register
//
//*************************************************************************************************
#define MEMCFG_CERRSET_CPURDERR    0x1U   // CPU Correctable Read Error Flag Set
#define MEMCFG_CERRSET_DMARDERR    0x2U   // DMA Correctable Read Error Flag Set
#define MEMCFG_CERRSET_CLA1RDERR   0x4U   // CLA1 Correctable Read Error Flag Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRCLR register
//
//*************************************************************************************************
#define MEMCFG_CERRCLR_CPURDERR    0x1U   // CPU Correctable Read Error Flag Clear
#define MEMCFG_CERRCLR_DMARDERR    0x2U   // DMA Correctable Read Error Flag Clear
#define MEMCFG_CERRCLR_CLA1RDERR   0x4U   // CLA1 Correctable Read Error Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRTHRES register
//
//*************************************************************************************************
#define MEMCFG_CERRTHRES_CERRTHRES_S   0U
#define MEMCFG_CERRTHRES_CERRTHRES_M   0xFFFFU   // Correctable error threshold.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTFLG register
//
//*************************************************************************************************
#define MEMCFG_CEINTFLG_CEINTFLAG   0x1U   // Total corrected error count exceeded threshold flag.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTCLR register
//
//*************************************************************************************************
#define MEMCFG_CEINTCLR_CEINTCLR   0x1U   // CPU Corrected Error Threshold Exceeded Error Clear.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTSET register
//
//*************************************************************************************************
#define MEMCFG_CEINTSET_CEINTSET   0x1U   // Total corrected error count exceeded flag set.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTEN register
//
//*************************************************************************************************
#define MEMCFG_CEINTEN_CEINTEN   0x1U   // CPU/DMA Correctable Error Interrupt Enable.


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU_RAM_TEST_ERROR_STS register
//
//*************************************************************************************************
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_COR_ERROR   0x1U   // COR_ERROR flag
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_UNC_ERROR   0x2U   // UNC_ERROR flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU_RAM_TEST_ERROR_STS_CLR register
//
//*************************************************************************************************
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_CLR_COR_ERROR   0x1U   // COR_ERROR flag clear bit
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_CLR_UNC_ERROR   0x2U   // UNC_ERROR flag clear bit



#endif
